### Pandas

In [2]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c']

In [4]:
my_data = [10,20,30]

In [5]:
arr = np.array(my_data)

In [6]:
d = {'a':10,'b':20,'c':30} #We have 4 separate python objects above

In [8]:
pd.Series(data = my_data) #1-d ndarray #indexed data

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(data = my_data, index = labels) #we can specify the python objects to be the index for the data

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(arr) #passing the array to create the series

0    10
1    20
2    30
dtype: int32

In [12]:
pd.Series(arr, labels) #passing the data and the labels for index explicitly to form the series

a    10
b    20
c    30
dtype: int32

In [13]:
pd.Series(d) #converting the dictionary to the series

a    10
b    20
c    30
dtype: int64

In [14]:
#Series can hold any type of python data objects as data points, which cannot be done with numpy array

pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [15]:
#storing built-in functions as the data points in the series
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [16]:
#Extracting information from Series object very fast

ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [17]:
ser1 #dtype is int64 because the data points stored in the series are integers

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [20]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [21]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [22]:
#getting the data from series using the label indexes

ser1['USA']

1

In [24]:
ser3 = pd.Series(data = labels)
ser3 #dtype is object as data points in the series is string

0    a
1    b
2    c
dtype: object

In [25]:
ser3[1] #getting the data by integer index

'b'

In [26]:
ser1 + ser2 #adding the series --> matches the data, if values of the index matches in both the series objects 
#then it adds, else NAN is placed in the resultant series

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

### Data Frames

In [27]:
import numpy as np
import pandas as pd

In [28]:
from numpy.random import randn

In [29]:
np.random.seed(101) # to make sure that we get the same random numbers when executed again

In [30]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'],['W','X','Y','Z'])

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
#Indexing and Selection
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [33]:
type(df['W']) #bracket notation to get the column

pandas.core.series.Series

In [34]:
type(df)

pandas.core.frame.DataFrame

In [35]:
df.W #Dot notation to get the specific column #not recommended

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [36]:
df[['W','Z']] #getting multiple columns

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [38]:
type(df[['W','Z']])

pandas.core.frame.DataFrame

In [40]:
#Creating a new column
df['new'] = df['W'] + df['Z']

In [41]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [43]:
#removing the column from dataframe

df.drop('new', axis = 1)  #axis =1 for column drop

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [44]:
df  #new  column is still there

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [45]:
#inplace argument --> to make the changes stay in the dataframe

df.drop('new',axis = 1, inplace = True)

In [46]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
df.drop('E', axis = 0) #axis = 0 for row (index)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [48]:
df.shape #0 is for rows and # 1 is for columns

(5, 4)

In [49]:
df[['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

In [50]:
#Selecting Rows
#Both rows and columns are the series
df.loc['A'] #Labeled based index selection

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [51]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
#getting rows by index position

df.iloc[1] #getiing the row B

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [53]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
df.loc['B','Z'] #getting the specific elemnt from the dataframe 

#similar to getting the element from Numpy 2-d array

0.6059653494949336

In [57]:
#getting the subset of the dataframe by passing the list of rows and columns

df.loc[['A','C'],['W','Z']]

          W         Z
A  2.706850  0.503826
C -2.018168 -0.589001

### Conditional Selection in DataFrame

In [58]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [60]:
bool_df = df > 0

In [61]:
bool_df

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [62]:
df[bool_df] 
#Will get the values where the condition is true and NAN for the place where the condtition did not hold true in Dataframe

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [63]:
df[df>0]  #same result as seen in the last cell

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [64]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [65]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [66]:
df[df['W']>0] # for C , condition was false, hence did not show up

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [68]:
df[df['X']<0] #Only B and D satisfies the condition

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [69]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
resultdf = df[df['W']>0]

In [71]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [72]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [73]:
#The above result can be achieved by different method also

df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [75]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [78]:
#The other way to get the result as shown above

boolres = df['W']>0
res = df[boolres]
my_cols = ['X','Y']
res[my_cols]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [79]:
#Multiple conditions

df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [80]:
df[(df['W']>0) & (df['Y']>1)]  
# keyword 'and' and 'or' will not work here with series objects. Hence & and | have to be used

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [81]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [82]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [83]:
#resetting the index on the dataframe
df.reset_index()

#index will be reset to numerical column index
#old index will become the column in the dataframe
#to make the changes stay for resetting, we have to use inplace=True

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [84]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [88]:
#creating a new index

new_index = 'CA NY IL OR CO'.split() #splitting on space
new_index

['CA', 'NY', 'IL', 'OR', 'CO']

In [89]:
df['States'] = new_index

In [90]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     IL
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [91]:
#setting the index of dataframe to the State column

df.set_index('States')  #inplace = True should be done to make the changes permanent in the dataframe

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
IL     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [93]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     IL
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

### Multi level index and Index Heirarchy

In [94]:
import numpy as np
import pandas as pd

In [95]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]

In [96]:
hier_index = list(zip(outside,inside))  # combining 2 lists into 1 consisting of tuples formed out of 2 lists

In [97]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [100]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [101]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [102]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [103]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [106]:
#Getting the results from multi-index (heirarchical) dataframe
#loc to filter the rows
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [107]:
df.loc['G1'].loc[2]

A   -1.706086
B   -1.159119
Name: 2, dtype: float64

In [108]:
df.index.names #indices dont have any names

FrozenList([None, None])

In [109]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [110]:
df.index.names = ['Groups','Num']

In [111]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [112]:
df.loc['G2'].loc[2]['B']  #getting the specific element

0.07295967531703869

In [114]:
#Cross-Section function --> xs
#used to get the innder level heirarchical index without mentioning upper heirarchy level
df.xs(1,level = 'Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [115]:
df.xs(3, level = 'Num') # we will get the Num 3 from both the groups

               A         B
Groups
G1     -0.134841  0.390528
G2      0.638787  0.329646

In [116]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [117]:
df.xs(2, level = 'Num')

               A         B
Groups
G1     -1.706086 -1.159119
G2      0.807706  0.072960

In [120]:
df.loc['G1'].loc[2]

A   -1.706086
B   -1.159119
Name: 2, dtype: float64

In [122]:
df.xs('G2',level = 'Groups')

            A         B
Num
1    0.166905  0.184502
2    0.807706  0.072960
3    0.638787  0.329646

### Pandas Missing Data

In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {
    'A':[1,2,np.nan],
    'B':[4,np.nan,np.nan],
    'C':[1,2,3]
}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  4.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna() #will drop the rows with one or more NA values

     A    B  C
0  1.0  4.0  1

In [6]:
df.dropna(axis=1) # axis =1 to remove the columns with null values

   C
0  1
1  2
2  3

In [7]:
#setting the threshold to drop the NA values

df.dropna(thresh = 2) #row should have atleast 2 non null values to not get dropped

     A    B  C
0  1.0  4.0  1
1  2.0  NaN  2

In [8]:
df.dropna(axis = 1, thresh = 2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [9]:
#Filling the null values witha meaningful values
df.fillna(value = 'FILL NA')

         A        B  C
0        1        4  1
1        2  FILL NA  2
2  FILL NA  FILL NA  3

In [10]:
#Filling missing values with mean in a column
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Group By

In [11]:
import numpy as np
import pandas as pd

In [12]:
data = {
    'Company': ['GOOG','GOOG','GOOG','MSFT','MSFT','FB','FB'],
    'Person': ['Sam','Charlie','Amy','Vanessa','Charlie','James','Sarah'],
    'Sales': [150,200,200,300,500,250,400]
}

In [13]:
df = pd.DataFrame(data)

In [14]:
df

  Company   Person  Sales
0    GOOG      Sam    150
1    GOOG  Charlie    200
2    GOOG      Amy    200
3    MSFT  Vanessa    300
4    MSFT  Charlie    500
5      FB    James    250
6      FB    Sarah    400

In [15]:
df.groupby('Company') #group by object

In [16]:
byComp = df.groupby('Company') #grouping by the company

In [17]:
byComp.mean() #Calling the aggregate function with the group by object

              Sales
Company
FB       325.000000
GOOG     183.333333
MSFT     400.000000

In [18]:
byComp.sum()

         Sales
Company
FB         650
GOOG       550
MSFT       800

In [19]:
byComp.std()

              Sales
Company
FB       106.066017
GOOG      28.867513
MSFT     141.421356

In [20]:
byComp.sum().loc['FB'] #getting the specific company's data

Sales    650
Name: FB, dtype: int64

In [21]:
#doing it one line

df.groupby('Company').sum().loc['FB']

Sales    650
Name: FB, dtype: int64

In [22]:
byComp.count()

         Person  Sales
Company
FB            2      2
GOOG          3      3
MSFT          2      2

In [23]:
byComp.max()

          Person  Sales
Company
FB         Sarah    400
GOOG         Sam    200
MSFT     Vanessa    500

In [24]:
byComp.min()

          Person  Sales
Company
FB         James    250
GOOG         Amy    150
MSFT     Charlie    300

In [25]:
byComp.describe() #description of the dataframe after grouping by Company

        Sales
        count        mean         std    min    25%    50%    75%    max
Company
FB        2.0  325.000000  106.066017  250.0  287.5  325.0  362.5  400.0
GOOG      3.0  183.333333   28.867513  150.0  175.0  200.0  200.0  200.0
MSFT      2.0  400.000000  141.421356  300.0  350.0  400.0  450.0  500.0

In [26]:
byComp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    3.000000    2.000000
      mean   325.000000  183.333333  400.000000
      std    106.066017   28.867513  141.421356
      min    250.000000  150.000000  300.000000
      25%    287.500000  175.000000  350.000000
      50%    325.000000  200.000000  400.000000
      75%    362.500000  200.000000  450.000000
      max    400.000000  200.000000  500.000000

In [27]:
 byComp.describe().transpose()['GOOG'] #Specific column's data description

Sales  count      3.000000
       mean     183.333333
       std       28.867513
       min      150.000000
       25%      175.000000
       50%      200.000000
       75%      200.000000
       max      200.000000
Name: GOOG, dtype: float64

### Operations

In [28]:
import numpy as np
import pandas as pd

In [32]:
df = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[666,444,555,666],
    'col3':['abc','def','ghi','jkl']
})

In [33]:
df

   col1  col2 col3
0     1   666  abc
1     2   444  def
2     3   555  ghi
3     4   666  jkl

In [34]:
#Finding unique values in a column

df['col2'].unique()  #returns the unique values in the column

array([666, 444, 555], dtype=int64)

In [35]:
df['col2'].nunique() #gives the number of unique values in the column

3

In [36]:
df['col2'].value_counts() #returns the number of times each unique value appeared in the column

666    2
555    1
444    1
Name: col2, dtype: int64

In [37]:
df

   col1  col2 col3
0     1   666  abc
1     2   444  def
2     3   555  ghi
3     4   666  jkl

In [38]:
#Conditional Operation

df[df['col1']>2] #returns the dataframe where value of the col1 column is greater than 2 in the dataframe

   col1  col2 col3
2     3   555  ghi
3     4   666  jkl

In [39]:
df['col1']>2 #boolean series showing where the condition meets

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [41]:
#AND operation
df[(df['col1']>2) & (df['col2'] == 555)]

   col1  col2 col3
2     3   555  ghi

### Apply Function

In [48]:
def times2(x):
    return x * 2

In [49]:
df['col1'].sum() #built-in function

10

In [50]:
#Apply functions lets us apply our custom function

df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [51]:
#Using the apply function, we can also apply built-in functions

df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [52]:
#Lambda expression helps us to define the functionality and not define the function when we want to use it only once
#Apply function come in handy when used with lambda expression
df['col3'].apply(lambda x:x*2)

0    abcabc
1    defdef
2    ghighi
3    jkljkl
Name: col3, dtype: object

In [53]:
df

   col1  col2 col3
0     1   666  abc
1     2   444  def
2     3   555  ghi
3     4   666  jkl

In [54]:
df.drop('col1',axis=1) #dropping the column

   col2 col3
0   666  abc
1   444  def
2   555  ghi
3   666  jkl

In [55]:
df.columns #to get the list of columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [56]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [57]:
#sorting by values by speccific column

df.sort_values('col2')

   col1  col2 col3
1     2   444  def
2     3   555  ghi
0     1   666  abc
3     4   666  jkl

In [58]:
#To check the null values

df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

### Pivot Table

In [59]:
data = {
    'A':['foo','foo','foo','bar','bar','bar'],
    'B':['one','one','two','two','one','one'],
    'C':['x','y','x','y','x','y'],
    'D':[1,3,2,5,4,1]
}

In [60]:
df = pd.DataFrame(data)

In [61]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [62]:
df.pivot_table(values = 'D',index = ['A','B'], columns = 'C') #Multi-level indexing

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN